MikroElektronika/core_packages/PIC/XC8/def/PIC18F57Q43/mcu.h
extern volatile DMA4PRbits_t DMA4PRbits __at(0x0B9);
// bitfield macros
#define _DMA4PR_PR_POSN                                     0x0
#define _DMA4PR_PR_POSITION                                 0x0
#define _DMA4PR_PR_SIZE                                     0x3
#define _DMA4PR_PR_LENGTH                                   0x3
#define _DMA4PR_PR_MASK                                     0x7
#define _DMA4PR_PR0_POSN                                    0x0
#define _DMA4PR_PR0_POSITION                                0x0
#define _DMA4PR_PR0_SIZE                                    0x1
#define _DMA4PR_PR0_LENGTH                                  0x1
#define _DMA4PR_PR0_MASK                                    0x1
#define _DMA4PR_PR1_POSN                                    0x1
#define _DMA4PR_PR1_POSITION                                0x1
#define _DMA4PR_PR1_SIZE                                    0x1
#define _DMA4PR_PR1_LENGTH                                  0x1
#define _DMA4PR_PR1_MASK                                    0x2
#define _DMA4PR_PR2_POSN                                    0x2
#define _DMA4PR_PR2_POSITION                                0x2
#define _DMA4PR_PR2_SIZE                                    0x1
#define _DMA4PR_PR2_LENGTH                                  0x1
#define _DMA4PR_PR2_MASK                                    0x4
#define _DMA4PR_DMA4PR_POSN                                 0x0
#define _DMA4PR_DMA4PR_POSITION                             0x0
#define _DMA4PR_DMA4PR_SIZE                                 0x3
#define _DMA4PR_DMA4PR_LENGTH                               0x3
#define _DMA4PR_DMA4PR_MASK                                 0x7
#define _DMA4PR_DMA4PR0_POSN                                0x0
#define _DMA4PR_DMA4PR0_POSITION                            0x0
#define _DMA4PR_DMA4PR0_SIZE                                0x1
#define _DMA4PR_DMA4PR0_LENGTH                              0x1
#define _DMA4PR_DMA4PR0_MASK                                0x1
#define _DMA4PR_DMA4PR1_POSN                                0x1
#define _DMA4PR_DMA4PR1_POSITION                            0x1
#define _DMA4PR_DMA4PR1_SIZE                                0x1
#define _DMA4PR_DMA4PR1_LENGTH                              0x1
#define _DMA4PR_DMA4PR1_MASK                                0x2
#define _DMA4PR_DMA4PR2_POSN                                0x2
#define _DMA4PR_DMA4PR2_POSITION                            0x2
#define _DMA4PR_DMA4PR2_SIZE                                0x1
#define _DMA4PR_DMA4PR2_LENGTH                              0x1
#define _DMA4PR_DMA4PR2_MASK                                0x4

// Register: DMA5PR
#define DMA5PR DMA5PR
extern volatile unsigned char           DMA5PR              __at(0x0BA);
#ifndef _LIB_BUILD
asm("DMA5PR equ 0BAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned _PR0                    :1;  // Note: Changed by MikroE
        unsigned _PR1                    :1;  // Note: Changed by MikroE
        unsigned _PR2                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned DMA5PR                 :3;
    };
    struct {
        unsigned DMA5PR0                :1;
        unsigned DMA5PR1                :1;
        unsigned DMA5PR2                :1;
    };
} DMA5PRbits_t;
extern volatile DMA5PRbits_t DMA5PRbits __at(0x0BA);
// bitfield macros
#define _DMA5PR_PR_POSN                                     0x0
#define _DMA5PR_PR_POSITION                                 0x0
#define _DMA5PR_PR_SIZE                                     0x3
#define _DMA5PR_PR_LENGTH                                   0x3
#define _DMA5PR_PR_MASK                                     0x7
#define _DMA5PR_PR0_POSN                                    0x0
#define _DMA5PR_PR0_POSITION                                0x0
#define _DMA5PR_PR0_SIZE                                    0x1
#define _DMA5PR_PR0_LENGTH                                  0x1
#define _DMA5PR_PR0_MASK                                    0x1
#define _DMA5PR_PR1_POSN                                    0x1
#define _DMA5PR_PR1_POSITION                                0x1
#define _DMA5PR_PR1_SIZE                                    0x1
#define _DMA5PR_PR1_LENGTH                                  0x1
#define _DMA5PR_PR1_MASK                                    0x2
#define _DMA5PR_PR2_POSN                                    0x2
#define _DMA5PR_PR2_POSITION                                0x2
#define _DMA5PR_PR2_SIZE                                    0x1
#define _DMA5PR_PR2_LENGTH                                  0x1
#define _DMA5PR_PR2_MASK                                    0x4
#define _DMA5PR_DMA5PR_POSN                                 0x0
#define _DMA5PR_DMA5PR_POSITION                             0x0
#define _DMA5PR_DMA5PR_SIZE                                 0x3
#define _DMA5PR_DMA5PR_LENGTH                               0x3
#define _DMA5PR_DMA5PR_MASK                                 0x7
#define _DMA5PR_DMA5PR0_POSN                                0x0
#define _DMA5PR_DMA5PR0_POSITION                            0x0
#define _DMA5PR_DMA5PR0_SIZE                                0x1
#define _DMA5PR_DMA5PR0_LENGTH                              0x1
#define _DMA5PR_DMA5PR0_MASK                                0x1
#define _DMA5PR_DMA5PR1_POSN                                0x1
#define _DMA5PR_DMA5PR1_POSITION                            0x1
#define _DMA5PR_DMA5PR1_SIZE                                0x1
#define _DMA5PR_DMA5PR1_LENGTH                              0x1
#define _DMA5PR_DMA5PR1_MASK                                0x2
#define _DMA5PR_DMA5PR2_POSN                                0x2
#define _DMA5PR_DMA5PR2_POSITION                            0x2
#define _DMA5PR_DMA5PR2_SIZE                                0x1
#define _DMA5PR_DMA5PR2_LENGTH                              0x1
#define _DMA5PR_DMA5PR2_MASK                                0x4

