MikroElektronika/core_packages/PIC/XC8/def/PIC18F57Q43/mcu.h
// Register: NCO3ACC
#define NCO3ACC NCO3ACC
#ifndef __CCI__
extern volatile __uint24                NCO3ACC             __at(0x450);
#endif
#ifndef _LIB_BUILD
asm("NCO3ACC equ 0450h");
#endif

// Register: NCO3ACCL
#define NCO3ACCL NCO3ACCL
extern volatile unsigned char           NCO3ACCL            __at(0x450);
#ifndef _LIB_BUILD
asm("NCO3ACCL equ 0450h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO3ACC0               :1;
        unsigned NCO3ACC1               :1;
        unsigned NCO3ACC2               :1;
        unsigned NCO3ACC3               :1;
        unsigned NCO3ACC4               :1;
        unsigned NCO3ACC5               :1;
        unsigned NCO3ACC6               :1;
        unsigned NCO3ACC7               :1;
    };
    struct {
        unsigned ACC0                   :1;
        unsigned ACC1                   :1;
        unsigned ACC2                   :1;
        unsigned ACC3                   :1;
        unsigned ACC4                   :1;
        unsigned ACC5                   :1;
        unsigned ACC6                   :1;
        unsigned ACC7                   :1;
    };
    struct {
        unsigned NCO3ACC                :8;
    };
} NCO3ACCLbits_t;
extern volatile NCO3ACCLbits_t NCO3ACCLbits __at(0x450);
// bitfield macros
#define _NCO3ACCL_ACC_POSN                                  0x0
#define _NCO3ACCL_ACC_POSITION                              0x0
#define _NCO3ACCL_ACC_SIZE                                  0x8
#define _NCO3ACCL_ACC_LENGTH                                0x8
#define _NCO3ACCL_ACC_MASK                                  0xFF
#define _NCO3ACCL_NCO3ACC0_POSN                             0x0
#define _NCO3ACCL_NCO3ACC0_POSITION                         0x0
#define _NCO3ACCL_NCO3ACC0_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC0_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC0_MASK                             0x1
#define _NCO3ACCL_NCO3ACC1_POSN                             0x1
#define _NCO3ACCL_NCO3ACC1_POSITION                         0x1
#define _NCO3ACCL_NCO3ACC1_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC1_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC1_MASK                             0x2
#define _NCO3ACCL_NCO3ACC2_POSN                             0x2
#define _NCO3ACCL_NCO3ACC2_POSITION                         0x2
#define _NCO3ACCL_NCO3ACC2_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC2_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC2_MASK                             0x4
#define _NCO3ACCL_NCO3ACC3_POSN                             0x3
#define _NCO3ACCL_NCO3ACC3_POSITION                         0x3
#define _NCO3ACCL_NCO3ACC3_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC3_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC3_MASK                             0x8
#define _NCO3ACCL_NCO3ACC4_POSN                             0x4
#define _NCO3ACCL_NCO3ACC4_POSITION                         0x4
#define _NCO3ACCL_NCO3ACC4_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC4_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC4_MASK                             0x10
#define _NCO3ACCL_NCO3ACC5_POSN                             0x5
#define _NCO3ACCL_NCO3ACC5_POSITION                         0x5
#define _NCO3ACCL_NCO3ACC5_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC5_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC5_MASK                             0x20
#define _NCO3ACCL_NCO3ACC6_POSN                             0x6
#define _NCO3ACCL_NCO3ACC6_POSITION                         0x6
#define _NCO3ACCL_NCO3ACC6_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC6_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC6_MASK                             0x40
#define _NCO3ACCL_NCO3ACC7_POSN                             0x7
#define _NCO3ACCL_NCO3ACC7_POSITION                         0x7
#define _NCO3ACCL_NCO3ACC7_SIZE                             0x1
#define _NCO3ACCL_NCO3ACC7_LENGTH                           0x1
#define _NCO3ACCL_NCO3ACC7_MASK                             0x80
#define _NCO3ACCL_ACC0_POSN                                 0x0
#define _NCO3ACCL_ACC0_POSITION                             0x0
#define _NCO3ACCL_ACC0_SIZE                                 0x1
#define _NCO3ACCL_ACC0_LENGTH                               0x1
#define _NCO3ACCL_ACC0_MASK                                 0x1
#define _NCO3ACCL_ACC1_POSN                                 0x1
#define _NCO3ACCL_ACC1_POSITION                             0x1
#define _NCO3ACCL_ACC1_SIZE                                 0x1
#define _NCO3ACCL_ACC1_LENGTH                               0x1
#define _NCO3ACCL_ACC1_MASK                                 0x2
#define _NCO3ACCL_ACC2_POSN                                 0x2
#define _NCO3ACCL_ACC2_POSITION                             0x2
#define _NCO3ACCL_ACC2_SIZE                                 0x1
#define _NCO3ACCL_ACC2_LENGTH                               0x1
#define _NCO3ACCL_ACC2_MASK                                 0x4
#define _NCO3ACCL_ACC3_POSN                                 0x3
#define _NCO3ACCL_ACC3_POSITION                             0x3
#define _NCO3ACCL_ACC3_SIZE                                 0x1
#define _NCO3ACCL_ACC3_LENGTH                               0x1
#define _NCO3ACCL_ACC3_MASK                                 0x8
#define _NCO3ACCL_ACC4_POSN                                 0x4
#define _NCO3ACCL_ACC4_POSITION                             0x4
#define _NCO3ACCL_ACC4_SIZE                                 0x1
#define _NCO3ACCL_ACC4_LENGTH                               0x1
#define _NCO3ACCL_ACC4_MASK                                 0x10
#define _NCO3ACCL_ACC5_POSN                                 0x5
#define _NCO3ACCL_ACC5_POSITION                             0x5
#define _NCO3ACCL_ACC5_SIZE                                 0x1
#define _NCO3ACCL_ACC5_LENGTH                               0x1
#define _NCO3ACCL_ACC5_MASK                                 0x20
#define _NCO3ACCL_ACC6_POSN                                 0x6
#define _NCO3ACCL_ACC6_POSITION                             0x6
#define _NCO3ACCL_ACC6_SIZE                                 0x1
#define _NCO3ACCL_ACC6_LENGTH                               0x1
#define _NCO3ACCL_ACC6_MASK                                 0x40
#define _NCO3ACCL_ACC7_POSN                                 0x7
#define _NCO3ACCL_ACC7_POSITION                             0x7
#define _NCO3ACCL_ACC7_SIZE                                 0x1
#define _NCO3ACCL_ACC7_LENGTH                               0x1
#define _NCO3ACCL_ACC7_MASK                                 0x80
#define _NCO3ACCL_NCO3ACC_POSN                              0x0
#define _NCO3ACCL_NCO3ACC_POSITION                          0x0
#define _NCO3ACCL_NCO3ACC_SIZE                              0x8
#define _NCO3ACCL_NCO3ACC_LENGTH                            0x8
#define _NCO3ACCL_NCO3ACC_MASK                              0xFF

// Register: NCO3ACCH
#define NCO3ACCH NCO3ACCH
extern volatile unsigned char           NCO3ACCH            __at(0x451);
#ifndef _LIB_BUILD
asm("NCO3ACCH equ 0451h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO3ACC8               :1;
        unsigned NCO3ACC9               :1;
        unsigned NCO3ACC10              :1;
        unsigned NCO3ACC11              :1;
        unsigned NCO3ACC12              :1;
        unsigned NCO3ACC13              :1;
        unsigned NCO3ACC14              :1;
        unsigned NCO3ACC15              :1;
    };
    struct {
        unsigned ACC8                   :1;
        unsigned ACC9                   :1;
        unsigned ACC10                  :1;
        unsigned ACC11                  :1;
        unsigned ACC12                  :1;
        unsigned ACC13                  :1;
        unsigned ACC14                  :1;
        unsigned ACC15                  :1;
    };
    struct {
        unsigned NCO3ACC                :8;
    };
} NCO3ACCHbits_t;
