MikroElektronika/core_packages/PIC/XC8/def/PIC18F57Q43/mcu.h
// Register: PORTF
#define PORTF PORTF
extern volatile unsigned char           PORTF               __at(0x4D3);
#ifndef _LIB_BUILD
asm("PORTF equ 04D3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0                    :1;
        unsigned RF1                    :1;
        unsigned RF2                    :1;
        unsigned RF3                    :1;
        unsigned RF4                    :1;
        unsigned RF5                    :1;
        unsigned RF6                    :1;
        unsigned RF7                    :1;
    };
} PORTFbits_t;
extern volatile PORTFbits_t PORTFbits __at(0x4D3);
// bitfield macros
#define _PORTF_RF0_POSN                                     0x0
#define _PORTF_RF0_POSITION                                 0x0
#define _PORTF_RF0_SIZE                                     0x1
#define _PORTF_RF0_LENGTH                                   0x1
#define _PORTF_RF0_MASK                                     0x1
#define _PORTF_RF1_POSN                                     0x1
#define _PORTF_RF1_POSITION                                 0x1
#define _PORTF_RF1_SIZE                                     0x1
#define _PORTF_RF1_LENGTH                                   0x1
#define _PORTF_RF1_MASK                                     0x2
#define _PORTF_RF2_POSN                                     0x2
#define _PORTF_RF2_POSITION                                 0x2
#define _PORTF_RF2_SIZE                                     0x1
#define _PORTF_RF2_LENGTH                                   0x1
#define _PORTF_RF2_MASK                                     0x4
#define _PORTF_RF3_POSN                                     0x3
#define _PORTF_RF3_POSITION                                 0x3
#define _PORTF_RF3_SIZE                                     0x1
#define _PORTF_RF3_LENGTH                                   0x1
#define _PORTF_RF3_MASK                                     0x8
#define _PORTF_RF4_POSN                                     0x4
#define _PORTF_RF4_POSITION                                 0x4
#define _PORTF_RF4_SIZE                                     0x1
#define _PORTF_RF4_LENGTH                                   0x1
#define _PORTF_RF4_MASK                                     0x10
#define _PORTF_RF5_POSN                                     0x5
#define _PORTF_RF5_POSITION                                 0x5
#define _PORTF_RF5_SIZE                                     0x1
#define _PORTF_RF5_LENGTH                                   0x1
#define _PORTF_RF5_MASK                                     0x20
#define _PORTF_RF6_POSN                                     0x6
#define _PORTF_RF6_POSITION                                 0x6
#define _PORTF_RF6_SIZE                                     0x1
#define _PORTF_RF6_LENGTH                                   0x1
#define _PORTF_RF6_MASK                                     0x40
#define _PORTF_RF7_POSN                                     0x7
#define _PORTF_RF7_POSITION                                 0x7
#define _PORTF_RF7_SIZE                                     0x1
#define _PORTF_RF7_LENGTH                                   0x1
#define _PORTF_RF7_MASK                                     0x80

// Register: INTCON0
#define INTCON0 INTCON0
extern volatile unsigned char           INTCON0             __at(0x4D6);
#ifndef _LIB_BUILD
asm("INTCON0 equ 04D6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0EDG                :1;
        unsigned INT1EDG                :1;
        unsigned INT2EDG                :1;
        unsigned                        :2;
        unsigned IPEN                   :1;
        unsigned GIEL                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :7;
        unsigned GIEH                   :1;
    };
} INTCON0bits_t;
extern volatile INTCON0bits_t INTCON0bits __at(0x4D6);
// bitfield macros
#define _INTCON0_INT0EDG_POSN                               0x0
#define _INTCON0_INT0EDG_POSITION                           0x0
#define _INTCON0_INT0EDG_SIZE                               0x1
#define _INTCON0_INT0EDG_LENGTH                             0x1
#define _INTCON0_INT0EDG_MASK                               0x1
#define _INTCON0_INT1EDG_POSN                               0x1
#define _INTCON0_INT1EDG_POSITION                           0x1
#define _INTCON0_INT1EDG_SIZE                               0x1
#define _INTCON0_INT1EDG_LENGTH                             0x1
#define _INTCON0_INT1EDG_MASK                               0x2
#define _INTCON0_INT2EDG_POSN                               0x2
#define _INTCON0_INT2EDG_POSITION                           0x2
#define _INTCON0_INT2EDG_SIZE                               0x1
#define _INTCON0_INT2EDG_LENGTH                             0x1
#define _INTCON0_INT2EDG_MASK                               0x4
#define _INTCON0_IPEN_POSN                                  0x5
#define _INTCON0_IPEN_POSITION                              0x5
#define _INTCON0_IPEN_SIZE                                  0x1
#define _INTCON0_IPEN_LENGTH                                0x1
#define _INTCON0_IPEN_MASK                                  0x20
#define _INTCON0_GIEL_POSN                                  0x6
#define _INTCON0_GIEL_POSITION                              0x6
#define _INTCON0_GIEL_SIZE                                  0x1
#define _INTCON0_GIEL_LENGTH                                0x1
#define _INTCON0_GIEL_MASK                                  0x40
#define _INTCON0_GIE_POSN                                   0x7
#define _INTCON0_GIE_POSITION                               0x7
#define _INTCON0_GIE_SIZE                                   0x1
#define _INTCON0_GIE_LENGTH                                 0x1
#define _INTCON0_GIE_MASK                                   0x80
#define _INTCON0_GIEH_POSN                                  0x7
#define _INTCON0_GIEH_POSITION                              0x7
#define _INTCON0_GIEH_SIZE                                  0x1
#define _INTCON0_GIEH_LENGTH                                0x1
#define _INTCON0_GIEH_MASK                                  0x80

